IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM2_CONTROLSS_G0_EPWM2.xml
<module name="CONTROLSS_G0_EPWM2_CONTROLSS_G0_EPWM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_G0_EPWM2_TBCTL" acronym="CONTROLSS_G0_EPWM2_TBCTL" offset="0x0" width="16" description="Time Base Control Register">
		<bitfield id="FREE_SOFT" width="2" begin="15" end="14" resetval="0x0" description="Emulation Mode Bits. These bits select the behavior of the ePWM time-base counter during emulation events   00: Stop after the next time-base counter increment or decrement  01: Stop when counter completes a whole cycle:  - Up-count mode: stop when the time-base counter = period [TBCTR = TBPRD]  - Down-count mode: stop when the time-base counter = 0x00 [TBCTR = 0x00]  - Up-down-count mode: stop when the time-base counter = 0x00 [TBCTR = 0x00]  1x: Free run" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="PHSDIR" width="1" begin="13" end="13" resetval="0x0" description="Phase Direction Bit  This bit is only used when the time-base counter is configured in the up-down-count mode. The PHSDIR bit indicates the direction the time-base counter [TBCTR] will count after a synchronization event occurs and a new phase value is loaded from the phase [TBPHS] register. This is irrespective of the direction of the counter before the synchronization event.. In the up-count and down-count modes this bit is ignored.   0: Count down after the synchronization event.  1: Count up after the synchronization event." range="13" rwaccess="R/W"/> 
		<bitfield id="CLKDIV" width="3" begin="12" end="10" resetval="0x0" description="Time Base Clock Pre-Scale Bits  These bits select the time base clock pre-scale value [TBCLK = EPWMCLK/[HSPCLKDIV * CLKDIV]:   000: /1 [default on reset]  001: /2  010: /4  011: /8  100: /16  101: /32  110: /64  111: /128" range="12 - 10" rwaccess="R/W"/> 
		<bitfield id="HSPCLKDIV" width="3" begin="9" end="7" resetval="0x1" description="High Speed Time Base Clock Pre-Scale Bits  These bits determine part of the time-base clock prescale value. TBCLK = EPWMCLK / [HSPCLKDIV x CLKDIV]. This divisor emulates the HSPCLK in the TMS320x281x system as used on the Event Manager [EV] peripheral.   000: /1  001: /2 [default on reset]  010: /4  011: /6  100: /8  101: /10  110: /12  111: /14" range="9 - 7" rwaccess="R/W"/> 
		<bitfield id="SWFSYNC" width="1" begin="6" end="6" resetval="0x0" description="Software Forced Sync Pulse   0: Writing a 0 has no effect and reads always return a 0.  1: Writing a 1 forces a one-time synchronization pulse to be generated. SWFSYNC can be enabled to affect EPWMxSYNCO by setting the EPWMSYNCOUTEN.SWEN bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="PRDLD" width="1" begin="3" end="3" resetval="0x0" description="Active Period Reg Load from Shadow Select   0: The period register [TBPRD] is loaded from its shadow register when the time-base counter, TBCTR, is equal to zero and/or a sync event as determined by the TBCTL2[PRDLDSYNC] bit.  A write/read to the TBPRD register accesses the shadow register.   1:  Immediate Mode [Shadow register bypassed]:  A write or read to the TBPRD register accesses the active register." range="3" rwaccess="R/W"/> 
		<bitfield id="PHSEN" width="1" begin="2" end="2" resetval="0x0" description="Counter Reg Load from Phase Reg Enable   0: Do not load the time-base counter [TBCTR] from the time-base phase register [TBPHS].  1: Allow Counter to be loaded from the Phase register [TBPHS] and shadow to active load events when an EPWMxSYNCI input signal occurs or a software-forced sync signal, see bit 6." range="2" rwaccess="R/W"/> 
		<bitfield id="CTRMODE" width="2" begin="1" end="0" resetval="0x3" description="Counter Mode  The time-base counter mode is normally configured once and not changed during normal operation. If you change the mode of the counter, the change will take effect at the next TBCLK edge and the current counter value shall increment or decrement from the value before the mode change. These bits set the time-base counter mode of operation as follows:  00: Up-count mode  01: Down-count mode  10: Up-down count mode  11: Freeze counter operation [default on reset]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM2_TBCTL2" acronym="CONTROLSS_G0_EPWM2_TBCTL2" offset="0x2" width="16" description="Time Base Control Register 2">
		<bitfield id="PRDLDSYNC" width="2" begin="15" end="14" resetval="0x0" description="Shadow to Active Period Register Load on SYNC event   00: Shadow to Active Load of TBPRD occurs only when TBCTR = 0 [same as legacy].  01: Shadow to Active Load of TBPRD occurs both when TBCTR = 0 and when SYNC occurs.  10: Shadow to Active Load of TBPRD occurs only when a SYNC is received.  11: Reserved  Note: This bit selection is valid only if TBCTL[PRDLD]=0." range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="OSHTSYNC" width="1" begin="7" end="7" resetval="0x0" description="Oneshot sync bit   0: Writing a '0' has no effect.  1: Allow one sync pulse to propogate." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="OSHTSYNCMODE" width="1" begin="6" end="6" resetval="0x0" description="Oneshot sync enable bit   0: Oneshot sync mode disabled  1: Oneshot sync mode enabled" range="6" rwaccess="R/W"/> 
		<bitfield id="SELFCLRTRREM" width="1" begin="5" end="5" resetval="0x0" description="Loop back sync pulse to enable self sync operation   0: Self clear function of TRREM disabled.  1: Self clear function of TRREM enabled" range="5" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM2_EPWMSYNCINSEL" acronym="CONTROLSS_G0_EPWM2_EPWMSYNCINSEL" offset="0x6" width="16" description="EPWMxSYNCIN Source Select Register">
		<bitfield id="SEL" width="7" begin="6" end="0" resetval="0x1" description="These bits determine the source of the EPWMxSYNCI signal 0x0: Disabled 0x01: EPWM0.SYNCOUT . 0x10: EPWM15.SYNCOUT 0x11:EPWM16.SYNCOUT . 0x20: EPWM31.SYNCOUT 0x21: Reserved . 0x40: ECAP0.SYNCOUT . 0x49: ECAP9.SYNCPUT 0x4A: Reserved . 0x4F: Reserved 0x50: InputXBar.Out[4] 0x51: InputXBar.Out[20] 0x52: Reserved . 0x57: Reserved 0x58: C2K_TimeSyncXBar..SYNCPWMOut0 0x59: C2K_TimeSyncXBar..SYNCPWMOut1 0x5A: Reserved 0x5F: Reserved 0x60: FSIRX0.RXTRIG[0] 0x61: FSIRX0.RXTRIG[1] 0x62: FSIRX0.RXTRIG[2] 0x63: FSIRX0.RXTRIG[3] 0x64: FSIRX1.RXTRIG[0] 0x65: FSIRX1.RXTRIG[1] 0x66: FSIRX1.RXTRIG[2] 0x67: FSIRX1.RXTRIG[3] 0x68: FSIRX2.RXTRIG[0] 0x69: FSIRX2.RXTRIG[1] 0x6A: FSIRX2.RXTRIG[2] 0x6B: FSIRX2.RXTRIG[3] 0x6C: FSIRX3.RXTRIG[0] 0x6D: FSIRX3.RXTRIG[1] 0x6E: FSIRX3.RXTRIG[2] 0x6F: FSIRX3.RXTRIG[3] 0x70: Reserved . 0x7F: Reserved" range="6 - 0" rwaccess="R/W"/>
	</register>
