IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM2_CONTROLSS_G0_EPWM2.xml
	<register id="CONTROLSS_G0_EPWM2_CMPC_SHDW3" acronym="CONTROLSS_G0_EPWM2_CMPC_SHDW3" offset="0x7BA" width="16" description="CMPC Shadow 3 Register">
		<bitfield id="CMPC_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="The value in the CMPC_SHDW3 register is loaded into CMPC_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM2_CMPD_SHDW3" acronym="CONTROLSS_G0_EPWM2_CMPD_SHDW3" offset="0x7BE" width="16" description="CMPD Shadow 3 Register">
		<bitfield id="CMPD_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="The value in the CMPD_SHDW3 register is loaded into CMPD_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM2_XMINMAX_SHDW3" acronym="CONTROLSS_G0_EPWM2_XMINMAX_SHDW3" offset="0x7C4" width="32" description="XMINMAX Shadow 3 Register">
		<bitfield id="XMIN_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="The value in the XMIN_SHDW3 register is loaded into XMIN_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XMAX_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="The value in the XMAX_SHDW3 register is loaded into XMAX_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM2_DECTL" acronym="CONTROLSS_G0_EPWM2_DECTL" offset="0x800" width="32" description="DE control register">
		<bitfield id="REENTRYDLY" width="8" begin="15" end="8" resetval="0x0" description="Determines the blocking window after DEACTIVE flag is cleared in which setting of DEACTIVE flag is prevented from being set. 0 : No blocking 1 : Blocked until 1 PWMSYNCOUT event 2 : Blocked until 2 PWMSYNCOUT events . . 255 : Blocked until 127 PWMSYNCOUT events" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="MODE" width="1" begin="1" end="1" resetval="0x0" description="0 : DEACTIVE flag works in cycle by cycle mode. On every PWMSYNCOUT, set condition of DEACTIVE flag is evaluated. If the set condition is not present the flag is cleared. 1 : DEACTIVE flag works in one shot mode [hardware set] and software clear." range="1" rwaccess="R/W"/> 
		<bitfield id="ENABLE" width="1" begin="0" end="0" resetval="0x0" description="DE function enable 0 : Diode Emulation mode functionality is disabled. DEACTIVE flag is not set on a TRIPH_OR_TRIPL event. 1 : Diode Emulation mode functionality is enabled. DEACTIVE flag is set on a TRIPH_OR_TRIPL event.  Note: ENABLE bit is cleared on a PWMTRIP event. Software has to re-enable this bit after PWMTRIP condition is serviced." range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM2_DECOMPSEL" acronym="CONTROLSS_G0_EPWM2_DECOMPSEL" offset="0x804" width="32" description="Used to configure the comparator whose trip sources will be used.">
		<bitfield id="TRIPH" width="6" begin="21" end="16" resetval="0x0" description="000000 : Reserved 000001 : Input-XBAR[0] is the source of TRIPH 000010 : Input-XBAR[1] is the source of TRIPH . . 100000 : Input-XBAR[31] is the source of TRIPH 100001 : CMPSSA0 is the source of TRIPH 100010 : CMPSSA1 is the source of TRIPH . . 101010 : CMPSSA9 is the source of TRIPH 101011 : Reserved . . 110000 : Reserved 110001 : CMPSSB0 is the source of TRIPH 110010 : CMPSSB1 is the source of TRIPH . . 111010 : CMPSSB9 is the source of TRIPH 111011 : Reserved . . 111111 : Reserved Note: All the reserved encodings result in TRIPH being 0." range="21 - 16" rwaccess="R/W"/> 
		<bitfield id="TRIPL" width="6" begin="5" end="0" resetval="0x0" description="000000 : Reserved 000001 : Input-XBAR[0] is the source of TRIPL 000010 : Input-XBAR[1] is the source of TRIPL . . 100000 : Input-XBAR[31] is the source of TRIPL 100001 : CMPSSA0 is the source of TRIPL 100010 : CMPSSA1 is the source of TRIPL . . 101010 : CMPSSA9 is the source of TRIPL 101011 : Reserved . . 110000 : Reserved 110001 : CMPSSB0 is the source of TRIPL 110010 : CMPSSB1 is the source of TRIPL . . 111010 : CMPSSB9 is the source of TRIPL 111011 : Reserved . . 111111 : Reserved Note: All the reserved encodings result in TRIPL being 0." range="5 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM2_DEACTCTL" acronym="CONTROLSS_G0_EPWM2_DEACTCTL" offset="0x808" width="32" description="Used to configure the PWM controls when in DE mode.">
		<bitfield id="TRIPENABLE" width="1" begin="16" end="16" resetval="0x0" description="0 : PWMTRIP does not bypass the diode emulation logic. 1 : PWMTRIP bypasses the diode emulation PWM generation logic [not complete bypass of module]" range="16" rwaccess="R/W"/> 
		<bitfield id="TRIPSELB" width="1" begin="6" end="6" resetval="0x0" description="0 : TRIPH 1 : TRIPL" range="6" rwaccess="R/W"/> 
		<bitfield id="PWMB" width="2" begin="5" end="4" resetval="0x0" description="00 : synchronized version of TRIPH or TRIPL signal as selected by the TRIPSELB 01 : synchronized and inverted version of TRIPH or TRIPL signal as selected by the TRIPSELB 10 : A constant 0 drives PWMB when DEACTIVE flag is set. 11 : A constant 1 drives PWMB when DEACTIVE flag is set." range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="TRIPSELA" width="1" begin="2" end="2" resetval="0x0" description="0 : TRIPH 1 : TRIPL" range="2" rwaccess="R/W"/> 
		<bitfield id="PWMA" width="2" begin="1" end="0" resetval="0x0" description="00 : synchronized version of TRIPH or TRIPL signal as selected by the TRIPSELA 01 : synchronized and inverted version of TRIPH or TRIPL signal as selected by the TRIPSELA 10 : A constant 0 drives PWMA when DEACTIVE flag is set. 11 : A constant 1 drives PWMA when DEACTIVE flag is set." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM2_DESTS" acronym="CONTROLSS_G0_EPWM2_DESTS" offset="0x80C" width="32" description="DE Status register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : Diode emulation mode is not active 1 : Diode emulation mode is active" range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G0_EPWM2_DEFRC" acronym="CONTROLSS_G0_EPWM2_DEFRC" offset="0x810" width="32" description="DE Status force register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : No effect. 1 : Forces DEACTIVE flag to 1." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G0_EPWM2_DECLR" acronym="CONTROLSS_G0_EPWM2_DECLR" offset="0x814" width="32" description="DE Status clear register">
		<bitfield id="DEACTIVE" width="1" begin="0" end="0" resetval="0x0" description="0 : No effect. 1 : Clears DEACTIVE flag." range="0" rwaccess="R/W1TS"/>
	</register>
